// Задача 27: Напишите программу, которая принимает 
// на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

Console.WriteLine("Введите число : ");
var num = Convert.ToInt32(Console.ReadLine());

int SumNum(in num)
{
   while (num > 0)
   {
        int num1 = num % 10;
   }
}

int num2 = num / 10;
int num = num - num2;
int result = 
i = 0;


